TWSE_FINANCE_STOCK_LIST = {
  bank: [
    2801, # 2801 彰銀
    2809, # 2809 京城銀
    2812, # 2812 台中銀
    2820, # 2820 華票
    2834, # 2834 臺企銀
    2836, # 2836 高雄銀
    2837, # 2837 萬泰銀
    2838, # 2838 聯邦銀
    2845, # 2845 遠東銀
    2847, # 2847 大眾銀
    2849, # 2849 安泰銀
    2880, # 2880 華南金
    2881, # 2881 富邦金
    2882, # 2882 國泰金
    2883, # 2883 開發金
    2884, # 2884 玉山金
    2885, # 2885 元大金
    2886, # 2886 兆豐金
    2887, # 2887 台新金
    2888, # 2888 新光金
    2889, # 2889 國票金
    2890, # 2890 永豐金
    2891, # 2891 中信金
    2892, # 2892 第一金
    5820, # 5820 日盛金
    5880  # 5880 合庫金
  ],

  assurance: [
    2816, # 2816 旺旺保
    2823, # 2823 中壽
    2832, # 2832 台產
    2833, # 2833 台壽保
    2850, # 2850 新產
    2851, # 2851 中再保
    2852, # 2852 第一保
    2867  # 2867 三商壽
  ],

  broker: [
    2855, # 2855 統一證
    2856, # 2856 元富證
    6005, # 6005 群益證
    6015, # 6015 宏遠證
    6016, # 6016 康和證
    6020, # 6020 大展證
    6021, # 6021 大慶證
    6022, # 6022 大眾證
    6023, # 6023 元大期
    6024  # 6024 群益期
  ]
}

def get_sub_category(ticker)
  return 'bank' if TWSE_FINANCE_STOCK_LIST[:bank].include?(ticker)
  return 'assurance' if TWSE_FINANCE_STOCK_LIST[:assurance].include?(ticker)
  return 'broker' if TWSE_FINANCE_STOCK_LIST[:broker].include?(ticker)
  return 'common'
end


puts get_sub_category(2816)
